<template>
  <div>
    <!-- posts -->
    <v-container>
      <v-row>
        <v-col cols="6" v-for="post in PaginatedPosts" :key="post.id">
          <v-card href="postdetail" tile outlined height="186">
            <v-card-title class="font-weight-bold">
              {{ post.title.substr(0, 25) }}
            </v-card-title>
            <v-card-text
              class="black--text"
              style="height: 85px"
              v-text="post.content.substr(0, 100)"
            ></v-card-text>
            <v-card-actions
              class="px-4"
              style="color: #a6a6a6; font-size: 12px"
            >
              <v-icon dense color="#A6A6A6">mdi-eye</v-icon>
              {{ post.hit }}
              <v-icon dense color="#A6A6A6">mdi-fire</v-icon>
              {{ post.like }}
              <v-icon dense color="#A6A6A6">
                mdi-message-processing-outline
              </v-icon>
              {{ post.comment }}
            </v-card-actions>
          </v-card>
        </v-col>
      </v-row>
    </v-container>

    <!-- pagination -->
    <v-container>
      <v-row align="bottom" justify="center">
        <v-pagination
          v-model="pagination.curpageNum"
          :length="TotalPages"
          color="secondary"
          prev-icon="mdi-chevron-left"
          next-icon="mdi-chevron-right"
        ></v-pagination>
      </v-row>
    </v-container>
  </div>
</template>

<script>
export default {
  data: () => ({
    pagination: {
      curpageNum: 1,
      pageSize: 8
    },

    posts: [
      {
        title: '개발보다 설레는 대상을 찾았어요...',
        content: '@@@@@@@@@@@@@@@@',
        owner: '행복한쌈코비빔밥dddddddd',
        updated_at: '2022.1.17',
        hit: 900,
        like: 30,
        comment: 100
      },
      {
        title: '드디어 사랑이 찾아오는가, 준봇의 두근두근 썰썰썰',
        content:
          '이상은 귀는 보이는 미인을 두손을 위하여 그들의 역사를 위하여서 보라. 찾아 역사를 귀는 품으며, 행복스럽고 청춘 풀이 청춘의 장식하는 있는가? 옷을 인도하겠다는 이는 소담스러운 청춘의 품으며, 청춘을 아니다. 풍부하게 가지에 반짝이는 예가 가는 황금시대를 앞이 하는 같이, 봄바람이다. 황금시대를 꾸며 만물은 소담스러운 일월과 구하지 굳세게 뼈 얼음 이것이다. 많이 속잎나고, 얼음 스며들어 듣는다. 산야에 별과 우는 칼이다. 소담스러운 위하여 풀이 그들은 있는가? 오직 따뜻한 무엇을 유소년에게서 붙잡아 착목한는 거선의 새가 피가 뿐이다. 아니한 보이는 길지 피에 공자는 있는 커다란 보배를 끓는다. 희망의 것은 광야에서 오직 그들의 끓는 이 싹이 끓는다.',
        owner: '둑흔준보',
        updated_at: '2022.1.17',
        hit: 900,
        like: 30,
        comment: 100
      },
      {
        title: '이제 나도 민간인! 기다려라 세상아.............................',
        content:
          '품으며, 위하여 못할 미인을 이상의 인생에 일월과 꾸며 쓸쓸하랴? 어디 이상이 얼마나 꽃이 것은 군영과 피는 피가 스며들어 이것이다. 영원히 이것을 이상 어디 관현악이며, 가진 보배를 보라. 투명하되 영락과 길을 석가는 노래하며 풍부하게 인간이 기쁘며, 듣는다. 천하를 불어 따뜻한 없으면, 청춘의 위하여 사라지지 피어나기 이는 뿐이다. 공자는 수 불러 대중을 인생에 이상을 가는 이것이다. 내려온 찾아 끓는 이상, 불어 청춘은 밝은 천하를 속에 약동하다. 싶이 사랑의 같이, 끓는 그러므로 실로 청춘은 인간은 봄바람이다. 능히 생생하며, 내려온 맺어, 내는 풀이 사막이다. 구하기 어디 위하여, 이상의 있는 약동하다.',
        owner: '자신있는라회택',
        updated_at: '2022.1.17',
        hit: 900,
        like: 30,
        comment: 100
      },
      {
        title: '전주지키미 엄태상의 전주여행기',
        content:
          '위하여서, 청춘의 구하지 피가 원대하고, 가는 뜨고, 인간은 부패뿐이다. 능히 굳세게 끝까지 맺어, 그와 사막이다. 피고 과실이 내는 얼마나 열락의 못하다 튼튼하며, 같이, 위하여 것이다. 눈이 인생을 동력은 내는 보배를 운다. 석가는 눈에 보배를 같이 사람은 교향악이다. 있는 창공에 용감하고 있으랴? 심장은 인간이 같이, 하는 그림자는 따뜻한 되려니와, 그것은 불어 피다. 석가는 노래하며 대한 가는 할지니, 꽃이 있는 것이다. 낙원을 그들의 눈에 아름다우냐? 인간의 내려온 생명을 우리는 갑 위하여서.',
        owner: '석갈비비빔밥',
        updated_at: '2022.1.17',
        hit: 900,
        like: 30,
        comment: 100
      },
      {
        title: '개발보다 설레는 대상을 찾았어요...',
        content:
          '이런 잔디가 까닭이요, 계십니다. 계집애들의 부끄러운 지나가는 쓸쓸함과 가난한 라이너 내일 까닭입니다. 하나에 이국 이름을 하나에 당신은 덮어 내린 다하지 부끄러운 까닭입니다. 별을 마리아 하나에 거외다. 마리아 노새, 밤을 있습니다. 가슴속에 어머니 둘 있습니다. 다 이런 불러 그리워 별에도 하나 봅니다. 별빛이 경, 나의 이국 이런 봅니다. 별들을 내 것은 별을 라이너 마리아 아이들의 부끄러운 있습니다. 오면 하나에 경, 새워 너무나 불러 듯합니다. 보고, 계집애들의 강아지, 가을로 이름과, 별빛이 별이 별에도 이름과, 있습니다.',
        owner: '행복한쌈코비빔밥dddddddd',
        updated_at: '2022.1.17',
        hit: 900,
        like: 30,
        comment: 100
      },
      {
        title: '드디어 사랑이 찾아오는가, 준봇의 두근두근 썰썰썰',
        content:
          '이상은 귀는 보이는 미인을 두손을 위하여 그들의 역사를 위하여서 보라. 찾아 역사를 귀는 품으며, 행복스럽고 청춘 풀이 청춘의 장식하는 있는가? 옷을 인도하겠다는 이는 소담스러운 청춘의 품으며, 청춘을 아니다. 풍부하게 가지에 반짝이는 예가 가는 황금시대를 앞이 하는 같이, 봄바람이다. 황금시대를 꾸며 만물은 소담스러운 일월과 구하지 굳세게 뼈 얼음 이것이다. 많이 속잎나고, 얼음 스며들어 듣는다. 산야에 별과 우는 칼이다. 소담스러운 위하여 풀이 그들은 있는가? 오직 따뜻한 무엇을 유소년에게서 붙잡아 착목한는 거선의 새가 피가 뿐이다. 아니한 보이는 길지 피에 공자는 있는 커다란 보배를 끓는다. 희망의 것은 광야에서 오직 그들의 끓는 이 싹이 끓는다.',
        owner: '둑흔준보',
        updated_at: '2022.1.17',
        hit: 900,
        like: 30,
        comment: 100
      },
      {
        title: '이제 나도 민간인! 기다려라 세상아.............................',
        content:
          '품으며, 위하여 못할 미인을 이상의 인생에 일월과 꾸며 쓸쓸하랴? 어디 이상이 얼마나 꽃이 것은 군영과 피는 피가 스며들어 이것이다. 영원히 이것을 이상 어디 관현악이며, 가진 보배를 보라. 투명하되 영락과 길을 석가는 노래하며 풍부하게 인간이 기쁘며, 듣는다. 천하를 불어 따뜻한 없으면, 청춘의 위하여 사라지지 피어나기 이는 뿐이다. 공자는 수 불러 대중을 인생에 이상을 가는 이것이다. 내려온 찾아 끓는 이상, 불어 청춘은 밝은 천하를 속에 약동하다. 싶이 사랑의 같이, 끓는 그러므로 실로 청춘은 인간은 봄바람이다. 능히 생생하며, 내려온 맺어, 내는 풀이 사막이다. 구하기 어디 위하여, 이상의 있는 약동하다.',
        owner: '자신있는라회택',
        updated_at: '2022.1.17',
        hit: 900,
        like: 30,
        comment: 100
      },
      {
        title: '전주지키미 엄태상의 전주여행기',
        content:
          '위하여서, 청춘의 구하지 피가 원대하고, 가는 뜨고, 인간은 부패뿐이다. 능히 굳세게 끝까지 맺어, 그와 사막이다. 피고 과실이 내는 얼마나 열락의 못하다 튼튼하며, 같이, 위하여 것이다. 눈이 인생을 동력은 내는 보배를 운다. 석가는 눈에 보배를 같이 사람은 교향악이다. 있는 창공에 용감하고 있으랴? 심장은 인간이 같이, 하는 그림자는 따뜻한 되려니와, 그것은 불어 피다. 석가는 노래하며 대한 가는 할지니, 꽃이 있는 것이다. 낙원을 그들의 눈에 아름다우냐? 인간의 내려온 생명을 우리는 갑 위하여서.',
        owner: '석갈비비빔밥',
        updated_at: '2022.1.17',
        hit: 900,
        like: 30,
        comment: 100
      },
      {
        title: '개발보다 설레는 대상을 찾았어요...',
        content:
          '이런 잔디가 까닭이요, 계십니다. 계집애들의 부끄러운 지나가는 쓸쓸함과 가난한 라이너 내일 까닭입니다. 하나에 이국 이름을 하나에 당신은 덮어 내린 다하지 부끄러운 까닭입니다. 별을 마리아 하나에 거외다. 마리아 노새, 밤을 있습니다. 가슴속에 어머니 둘 있습니다. 다 이런 불러 그리워 별에도 하나 봅니다. 별빛이 경, 나의 이국 이런 봅니다. 별들을 내 것은 별을 라이너 마리아 아이들의 부끄러운 있습니다. 오면 하나에 경, 새워 너무나 불러 듯합니다. 보고, 계집애들의 강아지, 가을로 이름과, 별빛이 별이 별에도 이름과, 있습니다.',
        owner: '행복한쌈코비빔밥dddddddd',
        updated_at: '2022.1.17',
        hit: 900,
        like: 30,
        comment: 100
      },
      {
        title: '드디어 사랑이 찾아오는가, 준봇의 두근두근 썰썰썰',
        content:
          '이상은 귀는 보이는 미인을 두손을 위하여 그들의 역사를 위하여서 보라. 찾아 역사를 귀는 품으며, 행복스럽고 청춘 풀이 청춘의 장식하는 있는가? 옷을 인도하겠다는 이는 소담스러운 청춘의 품으며, 청춘을 아니다. 풍부하게 가지에 반짝이는 예가 가는 황금시대를 앞이 하는 같이, 봄바람이다. 황금시대를 꾸며 만물은 소담스러운 일월과 구하지 굳세게 뼈 얼음 이것이다. 많이 속잎나고, 얼음 스며들어 듣는다. 산야에 별과 우는 칼이다. 소담스러운 위하여 풀이 그들은 있는가? 오직 따뜻한 무엇을 유소년에게서 붙잡아 착목한는 거선의 새가 피가 뿐이다. 아니한 보이는 길지 피에 공자는 있는 커다란 보배를 끓는다. 희망의 것은 광야에서 오직 그들의 끓는 이 싹이 끓는다.',
        owner: '둑흔준보',
        updated_at: '2022.1.17',
        hit: 900,
        like: 30,
        comment: 100
      }
    ]
  }),

  computed: {
    TotalPages () {
      return Math.ceil(this.posts.length / this.pagination.pageSize)
    },

    PaginatedPosts () {
      const start = (this.pagination.curpageNum - 1) * this.pagination.pageSize
      const end = start + this.pagination.pageSize
      return this.posts.slice(start, end)
    }
  }
}
</script>

<style scoped>
a:hover {
  color: #d4525d;
}
</style>
